# SheetCurrentRevisionIssuedBy Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetCurrentRevisionIssuedBy Property
ParameterTypeId Class See Also
---
"Current Revision Issued By"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetCurrentRevisionIssuedBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetCurrentRevisionIssuedBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetCurrentRevisionIssuedBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace